## Требования к верстке

### Страница Main — `60/60`

#### 1. Проверка верстки — `7/7`

| Status | Scores | Task                                                                                                                                                                                                                                                                                                                                                                                                                           |
|--------|--------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [+]    | `4/4`  | верстка страницы валидная: для проверки валидности вёрстки используйте сервис [https://validator.w3.org/](https://validator.w3.org/).<br>*Валидной вёрстке соответствует надпись "Document checking completed. No errors or warnings to show." В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - `warnings`, но нет ошибок - `errors`, выставляем половину баллов за пункт требований* |
| [+]    | `1/1`  | логотип в хедере состоит из текстовых элементов                                                                                                                                                                                                                                                                                                                                                                                |
| [+]    | `1/1`  | страница содержит ровно один элемент `<h1>`                                                                                                                                                                                                                                                                                                                                                                                    |
| [+]    | `1/1`  | добавлен favicon                                                                                                                                                                                                                                                                                                                                                                                                               |

#### 2. Вёрстка соответствует макету — `35/35`

| Status | Scores | Task               |
|--------|--------|--------------------|
| [+]    | `5/5`  | блок `<header>`    |
| [+]    | `5/5`  | блок `Not only`    |
| [+]    | `5/5`  | блок `About`       |
| [+]    | `5/5`  | блок `Our Friends` |
| [+]    | `5/5`  | блок `Help`        |
| [+]    | `5/5`  | блок `In addition` |
| [+]    | `5/5`  | блок `<footer>`    |

#### 3. Требования к css — `6/6`

| Status | Scores | Task                                                                                                                                                                          |
|--------|--------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [+]    | `2/2`  | для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid)                                                                                    |
| [+]    | `2/2`  | при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине |
| [+]    | `2/2`  | фоновый цвет тянется на всю ширину страницы                                                                                                                                   |

#### 4. Интерактивность элементов — `12/12`

| Status | Scores | Task                                                                                                                                                                                                                                                                                                                                                                                                          |
|--------|--------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [+]    | `2/2`  | элемент `About the Shelter` в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны                                                                                                                                                                                                                                                                                                 |
| [+]    | `2/2`  | каждая карточка с питомцем в блоке **Our Friends** интерактивна при наведении на любую область этой карточки                                                                                                                                                                                                                                                                                                  |
| [+]    | `2/2`  | плавная прокрутка по якорям                                                                                                                                                                                                                                                                                                                                                                                   |
| [+]    | `2/2`  | выполняются все ссылочные связи согласно [Перечню ссылочных связей](https://github.com/rolling-scopes-school/tasks/blob/master/tasks/shelter/shelter-part1.md#%D0%BF%D0%B5%D1%80%D0%B5%D1%87%D0%B5%D0%BD%D1%8C-%D1%81%D1%81%D1%8B%D0%BB%D0%BE%D1%87%D0%BD%D1%8B%D1%85-%D1%81%D0%B2%D1%8F%D0%B7%D0%B5%D0%B9) для страницы `Main`                                                                               |
| [+]    | `2/2`  | выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства `cursor: pointer`, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета |
| [+]    | `2/2`  | обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы                                                                                                                                                                                                                                                                   |
<br>

### Страница Pets — `40/40`

#### 1. Проверка верстки — `7/7`

| Status | Scores | Task                                                                                                                                                                                                                                                                                                                                                                                                                           |
|--------|--------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [+]    | `4/4`  | верстка страницы валидная: для проверки валидности вёрстки используйте сервис [https://validator.w3.org/](https://validator.w3.org/).<br>*Валидной вёрстке соответствует надпись "Document checking completed. No errors or warnings to show." В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - `warnings`, но нет ошибок - `errors`, выставляем половину баллов за пункт требований* |
| [+]    | `1/1`  | логотип в хедере состоит из текстовых элементов                                                                                                                                                                                                                                                                                                                                                                                |
| [+]    | `1/1`  | страница содержит ровно один элемент `<h1>`                                                                                                                                                                                                                                                                                                                                                                                    |
| [+]    | `1/1`  | добавлен favicon                                                                                                                                                                                                                                                                                                                                                                                                               |



#### 2. Вёрстка соответствует макету — `15/15`

| Status | Scores | Task               |
|--------|--------|--------------------|
| [+]    | `5/5`  | блок `<header>`    |
| [+]    | `5/5`  | блок `Our Friends` |
| [+]    | `5/5`  | блок `<footer>`    |

#### 3. Требования к css — `4/4`

| Status | Scores | Task                                                                                                                                                                          |
|--------|--------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [+]    | `2/2`  | при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине |
| [+]    | `2/2`  | фоновый цвет тянется на всю ширину страницы                                                                                                                                   |

#### 4. Интерактивность элементов — `14/14`

| Status | Scores | Task                                                                                                                                                                                                                                                                                                                                                                                                           |
|--------|--------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [+]    | `2/2`  | элемент `Our pets` в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны.                                                                                                                                                                                                                                                                                                          |
| [+]    | `2/2`  | доступные кнопки пагинации (вправо) активны, недоступные (влево) - неактивны (disabled).                                                                                                                                                                                                                                                                                                                       |
| [+]    | `2/2`  | каждая карточка с питомцем в блоке **Our Friends** интерактивна при наведении на любую область этой карточки.                                                                                                                                                                                                                                                                                                  |
| [+]    | `2/2`  | плавная прокрутка по якорям.                                                                                                                                                                                                                                                                                                                                                                                   |
| [+]    | `2/2`  | выполняются все ссылочные связи согласно [Перечню ссылочных связей](https://github.com/rolling-scopes-school/tasks/blob/master/tasks/shelter/shelter-part1.md#%D0%BF%D0%B5%D1%80%D0%B5%D1%87%D0%B5%D0%BD%D1%8C-%D1%81%D1%81%D1%8B%D0%BB%D0%BE%D1%87%D0%BD%D1%8B%D1%85-%D1%81%D0%B2%D1%8F%D0%B7%D0%B5%D0%B9) для страницы `Main`.                                                                               |
| [+]    | `2/2`  | выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства `cursor: pointer`, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета. |
| [+]    | `2/2`  | обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы.                                                                                                                                                                                                                                                                   |
